<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">
        <title>Reservas</title>
        <link rel="stylesheet" href="css/parceiros.css">
        <script src="js/jquery-3.2.1.min.js" onload="window.$ = window.jQuery = module.exports;"></script>
        <script src="js/sorttable.js" charset="utf-8"></script>
        <script src="js/jquery-mask/jquery.mask.min.js" charset="utf-8"></script>
        <script type="text/javascript">
            var mysql = require('mysql');
            var con;
            const electron = require('electron');
            const remote = electron.remote;
            let win;

            function criarConexaoDB() {
                con = mysql.createConnection({
                    host     : 'localhost',
                    user     : 'root',
                    password : 'bcd127',
                    database : 'dbtourdreams'
                });
                con.connect(function(err) {
                    if(err){
                        console.log(err.code);
                        console.log(err.fatal);
                    }
                });
            }

            function selectDB() {
                criarConexaoDB();
                con.query('SELECT idParceiro, nomeParceiro, cnpj, emailParceiro FROM tbl_parceiro', function(err, rows, fields) {
                    if(err){
                        console.log("Houve um erro no SELECT");
                        console.log(err);
                        return;
                    }

                    //Criação de uma linha para a tabela HTML com os dados
                    //provenientes do banco de dados e preenchimento de selects
                    //para edição e exclusão de registros
                    var html = '';
                    for (var i = 0; i < rows.length; i++) {
                        html += '<tr>';
                        html += '<td>';
                        html += rows[i].idParceiro;
                        html += '</td>';
                        html += '<td>';
                        html += rows[i].nomeParceiro;
                        html += '</td>';
                        html += '<td>';
                        html += rows[i].cnpj;
                        html += '</td>';
                        html += '<td>';
                        html += rows[i].emailParceiro;
                        html += '</td>';
                        html += '</tr>';
                    }
                    console.log(html)
                    $("#tblParceiro tr").after(html);
                });
                con.end(function(){});
            }

            function inserirNovoParceiro() {
                var nome = $("#txtNome").val();
                var cnpj = $("#txtCnpj").val();
                var email = $("#txtEmail").val();
                var txtlogin = $("#txtLogin").val();
                var senha = $("#txtSenha").val();
                var idLogin;
                var idImagem;

                var login = {"login" : txtlogin,
                             "senha" : senha,
                             "idTipoLogin" : "2"};

                criarConexaoDB();
                con.query('INSERT INTO tbl_login SET ?', login, function(err, rows, fields) {
                    if(err){
                        console.log("Um erro ocorreu no INSERT.");
                        console.log(err);
                        return;
                    }

                    idLogin = rows.insertId;
                    var imagem = {"caminhoImagem" : "imagens/usuario/desktop.png"};

                    con.query('INSERT INTO tbl_imagem SET ?', imagem, function (err, rows, fields) {
                        if(err){
                            console.log("Um erro ocorreu no INSERT.");
                            console.log(err);
                            return;
                        }

                        idImagem = rows.insertId;
                        var parceiro = {"cnpj" : cnpj,
                                        "nomeParceiro" : nome,
                                        "idImagem" : idImagem,
                                        "idLogin" : idLogin,
                                        "emailParceiro" : email};

                        con.query('INSERT INTO tbl_parceiro SET ?', parceiro, function (err, rows, fields) {
                            if(err){
                                console.log("Um erro ocorreu no INSERT.");
                                console.log(err);
                                return;
                            }
                        });
                        con.end(function(){});
                        remote.getCurrentWindow().loadURL('file://' + __dirname + '/parceiros.html');
                    });
                });
            }

            $(document).ready(function () {
                $("#txtCnpj").mask('00.000.000/0000-00');
                selectDB();
            });
        </script>
    </head>
    <body>
        <div id="principal">
			<nav>
				<a href="bemvindo.html"><div id="navLogo">
					<img src="imagens/tourdreamsmini.png" alt="Logo">
				</div></a>
				<ul>
					<li>
						<a href="reservas.html">RESERVAS</a>
					</li>
					<li>
						<a href="financeiro.html">FINANCEIRO</a>
					</li>
					<li>
						<a href="parceiros.html">PARCEIROS</a>
					</li>
				</ul>
			</nav>
			<div id="toolbar">
				<div id="botoesBox">
					<div class="botao" onclick="window.close()">
					X
					</div>
				</div>
			</div>
			<div id="conteudo">
                <div id="tableBox">
                    <table class="sortable"  id="tblParceiro">
                        <tr>
                            <th class="th10"># Parceiro</th>
                            <th class="th30">Parceiro</th>
                            <th class="th30">CNPJ</th>
                            <th class="th30">Email</th>
                        </tr>

                    </table>
                </div>
                <div id="detalhesBox">
                    <div id="detalhesEsquerdo">
                        <table>
                            <tr>
                                <td colspan="2"><label for="txtNome">Nome</label></td>
                            </tr>
                            <tr>
                                <td colspan="2">
                                    <input type="text" name="txtNome" id="txtNome">
                                </td>
                            </tr>
                            <tr>
                                <td colspan="2"><label for="txtCNPJ">CNPJ</label></td>
                            </tr>
                            <tr>
                                <td colspan="2">
                                    <input type="text" name="txtCnpj" id="txtCnpj" maxlength="18">
                                </td>
                            </tr>
                            <tr>
                                <td colspan="2"><label for="txtEmail">Email</label></td>
                            </tr>
                            <tr>
                                <td colspan="2">
                                    <input type="email" name="txtEmail" id="txtEmail">
                                </td>
                            </tr>
                            <tr>
                                <td colspan="2">
                                    <label for="txtLogin">Login</label>
                                </td>
                            </tr>
                            <tr>
                                <td colspan="2"><input type="text" name="txtLogin" id="txtLogin"></td>
                            </tr>
                            <tr>
                                <td colspan="2"><label for="txtSenha">Senha</label></td>
                            </tr>
                            <tr>
                                <td colspan="2"><input type="password" name="txtSenha" id="txtSenha"></td>
                            </tr>
                            <tr>
                                <td><button type="button" name="btnRegistrar" onclick="inserirNovoParceiro()">REGISTRAR</button></td>
                            </tr>
                    </table>
                    </div>
                    <div id="detalhesDireito">
                        <div id="bgTOSOverflow">
                            <div id="bgTOSConteudo">
                            <p style="text-align: center;"><strong>TERMOS E CONDI&Ccedil;&Otilde;ES GERAIS DE USO</strong></p>
                            <p style="text-align: center;"><strong>DO SITE "TourDreams"</strong></p>
                            <p>&nbsp;</p>
                            <p>Estes termos e condi&ccedil;&otilde;es gerais de uso e de compra e venda aplicam-se aos servi&ccedil;os prestados pela pessoa jur&iacute;dica <strong>TourDreams LTDA</strong>, devidamente registrada sob o CNPJ n. 01.234.567/0123-45, com sede em: Av. Luiz Carlos Berrini; Bairro Brooklin; S&atilde;o Paulo - SP; CEP 04571-000 por meio do site TOURDREAMS, com o seguinte endere&ccedil;o: http://www.portaltourdreams.com.br/.</p>
                            <p>&nbsp;</p>
                            <ol>
                                <strong><li> DO OBJETO</li></strong>
                            </ol>
                            <p style="text-indent: 0cm;">&nbsp;</p>
                            <p>O site <strong>TourDreams</strong> caracteriza-se pela presta&ccedil;&atilde;o dos seguintes servi&ccedil;os, incluindo a venda &agrave; dist&acirc;ncia e por meio eletr&ocirc;nico de produtos e de servi&ccedil;os:</p>
                            <ul>
                                <li style="margin-left: 40px;">Disponibiliza&ccedil;&atilde;o do servi&ccedil;o de reservas de acomoda&ccedil;&otilde;es fornecidas por parceiros;</li>
                                <li style="margin-left: 40px;">Disponibiliza&ccedil;&atilde;o do servi&ccedil;o de avalia&ccedil;&atilde;o de acomoda&ccedil;&otilde;es;</li>
                                <li style="margin-left: 40px;">Disponibiliza&ccedil;&atilde;o do servi&ccedil;o de visualiza&ccedil;&atilde;o e realiza&ccedil;&atilde;o de avalia&ccedil;&otilde;es de destinos;</li>
                                <li style="margin-left: 40px;">Disponibiliza&ccedil;&atilde;o do servi&ccedil;o via aplicativo Android.</li>
                            </ul>
                            <p>&nbsp;</p>
                            <ol start="2">
                                <strong><li> DA ACEITA&Ccedil;&Atilde;O DOS TERMOS E CONDI&Ccedil;&Otilde;ES GERAIS DE USO</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>Todos aqueles que desejarem ter acesso aos servi&ccedil;os ofertados atrav&eacute;s do site <strong>TourDreams</strong> dever&atilde;o, primeiramente, se informar sobre as regras que comp&otilde;em o presente instrumento, as quais ficar&atilde;o dispon&iacute;veis para pronta e ampla consulta, em link direto no pr&oacute;prio site.</p>
                            <p>Ao utilizar o site <strong>TourDreams</strong>, o usu&aacute;rio aceita integralmente as presentes normas e compromete-se a observ&aacute;-las, sob risco de aplica&ccedil;&atilde;o das penalidades cab&iacute;veis. Antes de iniciar qualquer navega&ccedil;&atilde;o no site, o usu&aacute;rio dever&aacute; cientificar-se de eventuais modifica&ccedil;&otilde;es ou atualiza&ccedil;&otilde;es ocorridas nestes termos.</p>
                            <p>Caso n&atilde;o concorde com quaisquer das regras aqui descritas, o usu&aacute;rio deve, imediatamente, abster-se de utilizar o servi&ccedil;o. Se for de seu interesse, poder&aacute;, ainda, entrar em contato com o servi&ccedil;o de atendimento ao cliente, para apresentar-lhe as suas ressalvas.</p>
                            <p>&nbsp;</p>
                            <ol start="3">
                                <strong><li> DA NAVEGA&Ccedil;&Atilde;O</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>O editor do site <strong>TourDreams</strong> se compromete a utilizar todas as solu&ccedil;&otilde;es t&eacute;cnicas &agrave; sua disposi&ccedil;&atilde;o para permitir o acesso ao servi&ccedil;o 24 (vinte e quatro) horas por dia, 7 (sete) dias por semana. Entretanto, ele poder&aacute;, a qualquer momento, interromper, limitar ou suspender o acesso ao site ou a algumas de suas p&aacute;ginas, a fim de realizar atualiza&ccedil;&otilde;es, modifica&ccedil;&otilde;es de conte&uacute;do ou qualquer outra a&ccedil;&atilde;o julgada necess&aacute;ria para o seu bom funcionamento.</p>
                            <p>Os presentes termos e condi&ccedil;&otilde;es gerais de uso e de compra e venda se aplicam a todas as extens&otilde;es do site <strong>TourDreams</strong> em redes sociais ou em comunidades, tanto as j&aacute; existentes, quanto aquelas ainda a serem implementadas.</p>
                            <p>&nbsp;</p>
                            <ol start="4">
                                <strong><li> DA GEST&Atilde;O DO SITE</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>Para a boa gest&atilde;o, o editor do site <strong>TourDreams</strong> poder&aacute;, a qualquer momento:</p>
                            <ol>
                                <li>a) suspender, interromper ou limitar o acesso a todo ou a parte do site a uma categoria espec&iacute;fica de internautas;</li>
                            </ol>
                            <ol>
                                <li>b) remover toda informa&ccedil;&atilde;o que possa perturbar o funcionamento do site ou que estejam em conflito com normas de Direito brasileiro ou de Direito internacional;</li>
                                <li>c) suspender o site, a fim de realizar atualiza&ccedil;&otilde;es e modifica&ccedil;&otilde;es.</li>
                            </ol>
                            <p>&nbsp;</p>
                            <ol start="5">
                            <li><strong> DO CADASTRO</strong></li>
                            </ol>
                            <p>&nbsp;</p>
                            <p>Os servi&ccedil;os disponibilizados no site <strong>TourDreams</strong> apenas poder&atilde;o ser acessados por pessoas plenamente capazes, conforme o Direito brasileiro. Todos aqueles que n&atilde;o possu&iacute;rem plena capacidade civil - menores de 18 anos n&atilde;o emancipados, pr&oacute;digos, &eacute;brios habituais ou viciados em t&oacute;xicos e pessoas que n&atilde;o puderem exprimir sua vontade, por motivo transit&oacute;rio ou permanente - dever&atilde;o ser devidamente assistidos por seus representantes legais, que se responsabilizar&atilde;o pelo cumprimento das presentes regras.</p>
                            <p>Ao usu&aacute;rio, ser&aacute; permitido manter apenas uma conta junto ao site <strong>TourDreams</strong>. Contas duplicadas ser&atilde;o automaticamente desativadas pelo editor do site, sem preju&iacute;zo de demais penalidades cab&iacute;veis.</p>
                            <p>&nbsp;</p>
                            <p>Para o devido cadastramento junto ao servi&ccedil;o, o usu&aacute;rio dever&aacute; fornecer integralmente os dados requeridos. Todas as informa&ccedil;&otilde;es fornecidas pelo usu&aacute;rio devem ser precisas, verdadeiras e atualizadas. Em qualquer caso, o usu&aacute;rio responder&aacute;, em &acirc;mbito c&iacute;vel e criminal, pela veracidade, exatid&atilde;o e autenticidade dos dados informados.</p>
                            <p>O usu&aacute;rio dever&aacute; fornecer um endere&ccedil;o de e-mail v&aacute;lido, atrav&eacute;s do qual o site realizar&aacute; todos os contatos necess&aacute;rios. Todas as comunica&ccedil;&otilde;es enviadas para o referido endere&ccedil;o ser&atilde;o consideradas lidas pelo usu&aacute;rio, que se compromete, assim, a consultar regularmente suas mensagens recebidas e a respond&ecirc;-las em prazo razo&aacute;vel.</p>
                            <p><span>Ap&oacute;s a confirma&ccedil;&atilde;o de seu cadastro, o usu&aacute;rio possuir&aacute; um login (apelido) e uma senha pessoais, que dever&atilde;o ser por ele utilizados para o acesso a sua conta no site <strong>TourDreams</strong>. Estes dados de conex&atilde;o n&atilde;o poder&atilde;o ser informados pelo usu&aacute;rio a terceiros, sendo de sua inteira responsabilidade o uso que deles seja feito. O usu&aacute;rio </span></p>
                            <p>compromete-se a comunicar imediatamente ao editor do site quaisquer atividades suspeitas ou inesperadas em sua conta.</p>
                            <p>N&atilde;o ser&aacute; permitido ceder, vender, alugar ou transferir, de qualquer forma, a conta.</p>
                            <p>Ser&aacute; automaticamente descadastrado o usu&aacute;rio que descumprir quaisquer das normas contidas no presente instrumento, sendo-lhe vedado realizar nova inscri&ccedil;&atilde;o no site.</p>
                            <p>O usu&aacute;rio poder&aacute;, a qualquer tempo e sem necessidade de justifica&ccedil;&atilde;o, requerer o cancelamento de seu cadastro junto ao site <strong>TourDreams</strong>. O seu descadastramento ser&aacute; realizado o mais rapidamente poss&iacute;vel, desde que n&atilde;o sejam verificados d&eacute;bitos em aberto.</p>
                            <p>&nbsp;</p>
                            <ol start="6">
                                <strong><li> DAS RESPONSABILIDADES</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>O editor se responsabilizar&aacute; pelos defeitos ou v&iacute;cios encontrados nos servi&ccedil;os prestados pelo site <strong>TourDreams</strong>, desde que tenha lhes dado causa. Defeitos ou v&iacute;cios t&eacute;cnicos ou operacionais originados no pr&oacute;prio sistema do usu&aacute;rio n&atilde;o ser&atilde;o de responsabilidade do editor.</p>
                            <p>O editor responsabiliza-se apenas pelas informa&ccedil;&otilde;es que foram por ele diretamente divulgadas. Quaisquer informa&ccedil;&otilde;es inclu&iacute;das pelos usu&aacute;rios, tais como em coment&aacute;rios e em perfis pessoais, ser&atilde;o de inteira responsabilidade dos pr&oacute;prios.</p>
                            <p>O usu&aacute;rio &eacute; respons&aacute;vel, ainda:</p>
                            <p>&nbsp;</p>
                            <ol>
                                <li>a) pela correta utiliza&ccedil;&atilde;o do site e de seus servi&ccedil;os, prezando pela boa conviv&ecirc;ncia, pelo respeito e pela cordialidade no relacionamento com os demais usu&aacute;rios;</li>
                                <li>b) pelo cumprimento das regras contidas neste instrumento, bem como normas de Direito nacional e de Direito internacional;</li>
                                <li>c) pela prote&ccedil;&atilde;o dos dados de acesso &agrave; sua conta (login e senha).</li>
                            </ol>
                            <p>O editor n&atilde;o ser&aacute; respons&aacute;vel:</p>
                            <ol>
                                <li>a) pelas caracter&iacute;sticas intr&iacute;nsecas da internet, principalmente relativas &agrave; confiabilidade e &agrave; proced&ecirc;ncia das informa&ccedil;&otilde;es circulando nesta rede;</li>
                                <li>b) pelos conte&uacute;dos ou atividades il&iacute;citas praticadas atrav&eacute;s de seu site.</li>
                            </ol>
                            <p>&nbsp;</p>
                            <ol start="7">
                                <strong><li> DOS LINKS EXTERNOS</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>O site <strong>TourDreams</strong> pode conter links externos dirigindo o usu&aacute;rio para outras p&aacute;ginas da internet, sobre os quais o editor n&atilde;o exerce controle. Apesar das verifica&ccedil;&otilde;es pr&eacute;vias e regulares realizadas pelo editor, ele se isenta de qualquer responsabilidade sobre o conte&uacute;do encontrado nestes sites e servi&ccedil;os.</p>
                            <p>Poder&atilde;o ser inclu&iacute;dos links nas p&aacute;ginas e nos documentos do site <strong>TourDreams</strong>, desde que n&atilde;o sirvam para fins comerciais ou publicit&aacute;rios. Esta inclus&atilde;o depender&aacute; de autoriza&ccedil;&atilde;o pr&eacute;via do editor.</p>
                            <p>N&atilde;o ser&aacute; autorizada a inclus&atilde;o de p&aacute;ginas que divulguem quaisquer tipos de informa&ccedil;&otilde;es il&iacute;citas, violentas, pol&ecirc;micas, pornogr&aacute;ficas, xenof&oacute;bicas, discriminat&oacute;rias ou ofensivas.</p>
                            <p style="text-indent: 0cm;">&nbsp;</p>
                            <ol start="8">
                                <strong><li> DOS DIREITOS AUTORAIS</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>A estrutura do site <strong>TourDreams</strong>, bem como os textos, os gr&aacute;ficos, as imagens, as fotografias, os sons, os v&iacute;deos e as demais aplica&ccedil;&otilde;es inform&aacute;ticas que o comp&otilde;em s&atilde;o de propriedade do editor e s&atilde;o protegidas pela legisla&ccedil;&atilde;o brasileira e internacional referente &agrave; propriedade intelectual.</p>
                            <p>Qualquer representa&ccedil;&atilde;o, reprodu&ccedil;&atilde;o, adapta&ccedil;&atilde;o ou explora&ccedil;&atilde;o parcial ou total dos conte&uacute;dos, marcas e servi&ccedil;os propostos pelo site, por qualquer meio que seja, sem autoriza&ccedil;&atilde;o pr&eacute;via, expressa e escrita do editor, &eacute; estritamente vedada, podendo-se recorrer &agrave;s medidas c&iacute;veis e penais cab&iacute;veis. Est&atilde;o exclu&iacute;dos desta previs&atilde;o apenas os elementos que estejam expressamente designados no site como livres de direitos autorais.</p>
                            <p>&nbsp;</p>
                            <p>O acesso n&atilde;o gera para o usu&aacute;rio qualquer direito de propriedade intelectual relativo a elementos do site, os quais restam sob a propriedade exclusiva do editor.</p>
                            <p>&Eacute; vedado ao usu&aacute;rio incluir no site dados que possam modificar o seu conte&uacute;do ou sua apar&ecirc;ncia.</p>
                            <p>&nbsp;</p>
                            <ol start="9">
                                <strong><li> DA POL&Iacute;TICA DE PRIVACIDADE</li></strong>
                            </ol>
                            <p style="text-indent: 0cm;">&nbsp;</p>
                            <ol>
                                <strong><em><li> Dados pessoais </li></em></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p><strong>Todos os dados pessoais fornecidos pelo usu&aacute;rio no momento de seu cadastro ou que venham a ser solicitados posteriormente, a este t&iacute;tulo, permanecer&atilde;o sigilosos e n&atilde;o ser&atilde;o repassados a quaisquer parceiros do site, exceto quando essas informa&ccedil;&otilde;es forem indispens&aacute;veis para o processamento de compras e de entregas.</strong></p>
                            <p><strong>Em outras situa&ccedil;&otilde;es, o editor apenas poder&aacute; transmitir os dados pessoais a terceiros quando o usu&aacute;rio permiti-lo expressamente ou quando presentes as hip&oacute;teses legais previstas no direito brasileiro, tais como a requisi&ccedil;&atilde;o judicial.</strong></p>
                            <p><strong>&Eacute; de responsabilidade do editor a garantia de confidencialidade dos dados pessoais fornecidos pelos usu&aacute;rios, devendo proteger o site contra tentativas de viola&ccedil;&otilde;es ou acessos clandestinos &agrave; sua base de dados.</strong></p>
                            <ol start="2">
                                <strong><em><li> Dados de navega&ccedil;&atilde;o</li></em></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>&nbsp;<strong>O site recorre eventualmente &agrave;s t&eacute;cnicas de "cookies", que lhe permitem analisar as estat&iacute;sticas e as informa&ccedil;&otilde;es sobre a navega&ccedil;&atilde;o do usu&aacute;rio. Podem ser fornecidos, por exemplo, dados sobre o dispositivo utilizado pelo usu&aacute;rio e o seu local de acesso. Esta coleta de informa&ccedil;&otilde;es busca melhorar a navega&ccedil;&atilde;o, para o conforto do usu&aacute;rio, ao permitir apresentar-lhe servi&ccedil;os personalizados, de acordo com suas prefer&ecirc;ncias.</strong></p>
                            <p><strong>Estes dados de navega&ccedil;&atilde;o poder&atilde;o, ainda, ser compartilhados com eventuais parceiros do site, buscando o aprimoramento dos produtos e servi&ccedil;os ofertados ao usu&aacute;rio. </strong></p>
                            <p><strong>&nbsp;</strong></p>
                            <p><strong>O usu&aacute;rio poder&aacute; se opor ao registro de "cookies" pelo site, bastando desativar esta op&ccedil;&atilde;o no seu pr&oacute;prio navegador ou aparelho. Por outro lado, a desativa&ccedil;&atilde;o deste registro poder&aacute; afetar a disponibilidade</strong> <strong>de algumas ferramentas e alguns servi&ccedil;os do site.</strong></p>
                            <p>&nbsp;</p>
                            <ol start="10">
                                <strong><li> DAS OFERTAS E PRODUTOS</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>Por interm&eacute;dio do site <strong>TourDreams</strong>, o editor fornece ao cliente um cat&aacute;logo ou uma loja online apresentando com exatid&atilde;o os produtos e servi&ccedil;os vendidos. Os produtos e servi&ccedil;os est&atilde;o descritos e apresentados com o maior grau de precis&atilde;o poss&iacute;vel, contendo informa&ccedil;&otilde;es corretas, claras, precisas, ostensivas e em l&iacute;ngua portuguesa sobre suas caracter&iacute;sticas, qualidades, quantidade, composi&ccedil;&atilde;o, pre&ccedil;o, garantia, prazos de validade e origem, entre outros dados, bem como sobre os riscos que apresentam &agrave; sa&uacute;de e seguran&ccedil;a do usu&aacute;rio.</p>
                            <p>Os produtos e servi&ccedil;os s&atilde;o colocados &agrave; venda at&eacute; o limite do estoque dispon&iacute;vel.</p>
                            <p>Os pre&ccedil;os e as taxas referentes &agrave; venda dos produtos e servi&ccedil;os est&atilde;o inclu&iacute;dos no cat&aacute;logo ou na loja online.</p>
                            <p>Antes de finalizar a compra sobre determinado produto ou servi&ccedil;o, o usu&aacute;rio dever&aacute; se informar sobre as suas especifica&ccedil;&otilde;es e sobre a sua destina&ccedil;&atilde;o, bem como a faixa et&aacute;ria para a qual &eacute; recomendado. Em se tratando de produto ou servi&ccedil;o adquirido no &acirc;mbito de ofertas, o usu&aacute;rio dever&aacute; tamb&eacute;m observar as condi&ccedil;&otilde;es de aplica&ccedil;&atilde;o destas.</p>
                            <p>As ofertas ser&atilde;o disponibilizadas no site de acordo com a conveni&ecirc;ncia do editor. Elas poder&atilde;o ser conclu&iacute;das antes do prazo previsto, se o estoque for finalizado e n&atilde;o for poss&iacute;vel restabelec&ecirc;-lo com os fornecedores do site.</p>
                            <p>&nbsp;</p>
                            <ol start="11">
                                <strong><li> DOS PRE&Ccedil;OS</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>O vendedor se reserva o direito de modificar os pre&ccedil;os dos produtos e servi&ccedil;os a qualquer momento, publicando-os no site <strong>TourDreams</strong>.</p>
                            <p>Ser&atilde;o aplicadas as tarifas em vigor no momento do pedido, sob reserva de disponibilidade de produtos e servi&ccedil;os nesta data.</p>
                            <p>Os pre&ccedil;os ser&atilde;o indicados em reais e n&atilde;o incluir&atilde;o as taxas de entrega, as quais vir&atilde;o especificadas &agrave; parte e ser&atilde;o informadas ao cliente antes da realiza&ccedil;&atilde;o do pedido.</p>
                            <p>&nbsp;</p>
                            <p>O montante total do pedido, incluindo todas as taxas, ser&aacute; indicado antes da valida&ccedil;&atilde;o final do pedido.</p>
                            <p>&nbsp;</p>
                            <ol start="12">
                                <strong><li> DO PAGAMENTO</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>O pagamento do pedido dever&aacute; ser realizado &agrave; vista, atrav&eacute;s dos seguintes meios:</p>
                            <ul>
                                <li style="margin-left: 40px;">Cart&atilde;o de cr&eacute;dito;</li>
                                <li style="margin-left: 40px;"><em>In locco </em>na acomoda&ccedil;&atilde;o.</li>
                            </ul>
                            <p style="text-indent: 0cm;">&nbsp;</p>
                            <ol start="13">
                                <strong><li> DO SERVI&Ccedil;O DE ATENDIMENTO AO USU&Aacute;RIO</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>Em caso de d&uacute;vidas, sugest&otilde;es ou problemas com a utiliza&ccedil;&atilde;o do site <strong>TourDreams</strong>, o usu&aacute;rio poder&aacute; contatar diretamente o seu servi&ccedil;o de atendimento, atrav&eacute;s do endere&ccedil;o de e-mail: contato@tourdreams.com, bem como do telefone: (11) 1234-5678. Estes servi&ccedil;os de atendimento ao usu&aacute;rio estar&atilde;o dispon&iacute;veis de segunda &agrave; sexta-feira, das 07:00 &agrave;s 18:00.</p>
                            <p>O usu&aacute;rio poder&aacute;, ainda, optar por enviar correspond&ecirc;ncia ao endere&ccedil;o da sede do site TOURDREAMS, informado no in&iacute;cio deste documento.</p>
                            <p>&nbsp;</p>
                            <ol start="14">
                                <strong><li> DAS SAN&Ccedil;&Otilde;ES</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>Sem preju&iacute;zo das demais medidas legais cab&iacute;veis, o editor do site <strong>TourDreams</strong> poder&aacute;, a qualquer momento, advertir, suspender ou cancelar a conta do usu&aacute;rio:</p>
                            <ol>
                                <li>a) que descumprir quaisquer dos dispositivos contidos no presente instrumento;</li>
                                <li>b) que descumprir os seus deveres de usu&aacute;rio;</li>
                                <li>c) que praticar atos fraudulentos ou dolosos;</li>
                                <li>d) cujo comportamento constitua ou possa vir a importar ofensa ou danos a terceiros ou ao pr&oacute;prio site.</li>
                            </ol>
                            <p>&nbsp;</p>
                            <ol start="15">
                                <strong><li> DAS ALTERA&Ccedil;&Otilde;ES</li></strong>
                            </ol>
                            <p>A presente vers&atilde;o dos termos e condi&ccedil;&otilde;es gerais de uso e de compra e venda foi atualizada pela &uacute;ltima vez em: 14/10/2017.</p>
                            <p>O editor se reserva o direito de modificar, a qualquer momento e sem qualquer aviso pr&eacute;vio, o site e os servi&ccedil;os, bem como as presentes normas, especialmente para adapt&aacute;-las &agrave;s evolu&ccedil;&otilde;es do site TOURDREAMS, seja pela disponibiliza&ccedil;&atilde;o de novas funcionalidades, seja pela supress&atilde;o ou modifica&ccedil;&atilde;o daquelas j&aacute; existentes.</p>
                            <p>&nbsp;</p>
                            <ol start="16">
                                <strong><li> DO DIREITO APLIC&Aacute;VEL E DO FORO</li></strong>
                            </ol>
                            <p>&nbsp;</p>
                            <p>Para a solu&ccedil;&atilde;o das controv&eacute;rsias decorrentes do presente instrumento, ser&aacute; aplicado integralmente o Direito brasileiro, notadamente a sua legisla&ccedil;&atilde;o consumerista.</p>
                            <p>Os eventuais lit&iacute;gios dever&atilde;o ser apresentados no foro da comarca em que se encontra a sede do editor do site.</p>
                            <p>&nbsp;</p>
                            <p><em>Seja bem-vindo(a)!</em></p>
                            <p><em>A equipe do site <strong>TourDreams</strong> lhe deseja uma excelente navega&ccedil;&atilde;o!</em></p>
                        </div>
                        </div>
                    </div>
                </div>
			</div>
		</div>
    </body>
</html>
